; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_10)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 - link
    angle0 angle40 angle80 angle120 angle160 angle200 angle240 angle280 angle320 - angle)
(:init
    (AngleOrd angle0 angle40)
    (AngleOrd angle40 angle80)
    (AngleOrd angle80 angle120)
    (AngleOrd angle120 angle160)
    (AngleOrd angle160 angle200)
    (AngleOrd angle200 angle240)
    (AngleOrd angle240 angle280)
    (AngleOrd angle280 angle320)
    (AngleOrd angle320 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)

    (HasAngle angle240 link1)
    (HasAngle angle120 link2)
    (HasAngle angle240 link3)
    (HasAngle angle120 link4)
    (HasAngle angle160 link5)
    (HasAngle angle240 link6)
    (HasAngle angle280 link7)
    (HasAngle angle40 link8)
    (HasAngle angle200 link9)
)
(:goal
(and
    (HasAngle angle240 link1)
    (HasAngle angle120 link2)
    (HasAngle angle240 link3)
    (HasAngle angle80 link4)
    (HasAngle angle280 link5)
    (HasAngle angle0 link6)
    (HasAngle angle40 link7)
    (HasAngle angle200 link8)
    (HasAngle angle320 link9)
    )
)
)

; plan
1. (decrease_angle link4 angle120 angle80)
   deleted: (hasangle angle120 link4) (hasangle angle160 link5) (hasangle angle240 link6) (hasangle angle280 link7) (hasangle angle40 link8) (hasangle angle200 link9)
   added: (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle200 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle160 link9)
   goals met: 4 of 9
2. (increase_angle link5 angle120 angle160)
   deleted: (hasangle angle120 link5) (hasangle angle200 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle160 link9)
   added: (hasangle angle160 link5) (hasangle angle240 link6) (hasangle angle280 link7) (hasangle angle40 link8) (hasangle angle200 link9)
   goals met: 4 of 9
3. (increase_angle link5 angle160 angle200)
   deleted: (hasangle angle160 link5) (hasangle angle240 link6) (hasangle angle280 link7) (hasangle angle40 link8) (hasangle angle200 link9)
   added: (hasangle angle200 link5) (hasangle angle280 link6) (hasangle angle320 link7) (hasangle angle80 link8) (hasangle angle240 link9)
   goals met: 4 of 9
4. (increase_angle link5 angle200 angle240)
   deleted: (hasangle angle200 link5) (hasangle angle280 link6) (hasangle angle320 link7) (hasangle angle80 link8) (hasangle angle240 link9)
   added: (hasangle angle240 link5) (hasangle angle320 link6) (hasangle angle0 link7) (hasangle angle120 link8) (hasangle angle280 link9)
   goals met: 4 of 9
5. (increase_angle link5 angle240 angle280)
   deleted: (hasangle angle240 link5) (hasangle angle320 link6) (hasangle angle0 link7) (hasangle angle120 link8) (hasangle angle280 link9)
   added: (hasangle angle280 link5) (hasangle angle0 link6) (hasangle angle40 link7) (hasangle angle160 link8) (hasangle angle320 link9)
   goals met: 8 of 9
6. (decrease_angle link9 angle320 angle280)
   deleted: (hasangle angle320 link9)
   added: (hasangle angle280 link9)
   goals met: 7 of 9
7. (increase_angle link8 angle160 angle200)
   deleted: (hasangle angle160 link8) (hasangle angle280 link9)
   added: (hasangle angle200 link8) (hasangle angle320 link9)
   goals met: 9 of 9
